garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1618.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT2TMRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT2TMRU" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA0">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2TMR" edc:desc="" edc:mask="0xff" edc:name="SMT2TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2TMR16" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR17" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR18" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR19" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR20" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR21" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR22" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR23" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT2CPR" edc:desc="" edc:name="SMT2CPR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA1">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT2CPRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT2CPRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA1">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2CPR" edc:desc="" edc:mask="0xff" edc:name="SMT2CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2CPR0" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR1" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR2" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR3" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR4" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR5" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR6" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR7" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT2CPRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT2CPRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA2">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2CPR" edc:desc="" edc:mask="0xff" edc:name="SMT2CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2CPR8" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR9" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR10" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR11" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR12" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR13" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR14" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR15" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT2CPRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT2CPRU" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA3">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2CPR" edc:desc="" edc:mask="0xff" edc:name="SMT2CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SMT2CPR16" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR17" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR18" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR19" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR20" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR21" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR22" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPR23" edc:desc="" edc:mask="0x1" edc:name="SMT2CPR23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT2CPW" edc:desc="" edc:name="SMT2CPW" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA4">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT2CPWL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT2CPWL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA4">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2CPW" edc:desc="" edc:mask="0xff" edc:name="SMT2CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2CPW0" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW1" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW2" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW3" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW4" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW5" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW6" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW7" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT2CPWH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT2CPWH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2CPW" edc:desc="" edc:mask="0xff" edc:name="SMT2CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2CPW8" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW9" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW10" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW11" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW12" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW13" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW14" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW15" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
